const quote = document.querySelector('.quotes-block__quote');
const authorOfQuote = document.querySelector('.quotes-block__author');
const button = document.querySelector('#btn');

const quotes = [
    'Життя як п\'єса в театрі: важливо не те, скільки вона триває, а наскільки добре зіграна.',
    "Три речі ніколи не повертаються назад - час, слово, можливість. Тому не втрачай часу, вибирай слова, не прогав можливість.",
    "День - це маленьке життя, і прожити його треба так, ніби ти маєш померти зараз, а тобі зненацька подарували ще добу.",
    "Ми не можемо вирвати жодної сторінки з нашого життя, хоча легко можемо кинути у вогонь саму книгу.",    
    "Мета життя - самовираження. Проявити у всій повноті свою сутність - ось для чого ми живемо.",
    "У людини два життя: друге починається, коли розумієш, що життя тільки одне",
    "Коли людині здається, що все йде шкереберть, в її життя намагається увійти щось чудове",
    "Життю вір, адже вона вчить краще за будь-які книги",
    "Боятися треба не смерті, а пустого життя",
    "Погано живуть ті, які все життя лише збираються жити",
    "Уміти насолоджуватися прожитим життям - значить, жити двічі",
    "Життя - це квітка, а любов - нектар",
    "Поки ми відкладаємо життя, воно проходить",
    "Зроби крок і дорога появиться сама собою",
    "Кожен наш вчинок продовжує створювати нас самих",
    "Прагни не до того, щоб домогтися успіху, а до того, щоб твоє життя мало сенс.",
    "Життя – це мить. Її не можна прожити спочатку на чернетці, а потім переписати на чистовик.",
    "Життя занадто коротке, щоб бути маленьким.",
    "Ніхто не жив в минулому, нікому не доведеться жити в майбутньому; сьогодення і є форма життя.",
    "Я не можу дати універсальної формули успіху. Зате, я можу дати формулу провалу: спробуй всіх задовільнити."

];
const authors = [
    'Сенека', "Конфуцій", "Горький", "Конфуцій", "Оскар Вайльд", "Конфуцій", "Далай Лама", "Гете", "Бертольд Брехт", "Публій Сір", "Марціал", "Гюго", "Сенека", "Стів Джобс",
    "Фрідріх Ніцше", "Альберт Ейнштейн", "Антон Чехов", "Бенджамін Дізраелі", "Артур Шопенгауер", "Герберт Баярт Своп"
];


function generateQuotes() {

    const currentIndex = Math.floor(Math.random() * quotes.length);
    const quoteText = quotes[currentIndex];
    const authorText = authors[currentIndex];
    quote.textContent = quoteText;
    authorOfQuote.textContent = authorText;

}

button.addEventListener('click', () => generateQuotes());
